---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.BuildingPad
source: html/97ea7c08-5d52-93c6-fc91-fc0b0e903fb5.htm
---
# BuildingPad Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.